
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЛицензияПолучена Тогда
		ЗавершитьРаботуСистемы(Ложь);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЛицензию(Команда) 
	Если Пароль = "12345678" Тогда
		СисИнфо = Новый СистемнаяИнформация;
		РаботаСЛицензиями.ДобавитьЛицензию(СисИнфо.ИдентификаторКлиента);
		ЛицензияПолучена = Истина;
	КонецЕсли;
КонецПроцедуры


