
&НаСервере
Процедура ОтправитьНаСервере()
ПараметрыПочты = новый ИнтернетПочтовыйПрофиль;
    ПараметрыПочты.АдресСервераSMTP = "smtp.yandex.ru";
    ПараметрыПочты.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
    ПараметрыПочты.ПользовательSMTP = "timofei.melnickov2015@yandex.ru";
    ПараметрыПочты.ПарольSMTP="89154534356";
    
    Письмо=новый ИнтернетПочтовоеСообщение;
    Письмо.Тема="Тест";
    Письмо.ИмяОтправителя="Тимофей";
    Письмо.Отправитель="timofei.melnickov2015@yandex.ru";
    Письмо.Получатели.Добавить("svetlan4.melnickova@yandex.ru");
    //Письмо.Вложения.Добавить(ФайлОтчета);
    
    Подключение=новый ИнтернетПочта;
    Попытка
        Подключение.Подключиться(ПараметрыПочты);
        Подключение.Послать(Письмо);
        Сообщить("Письмо отправлено успешно");
    Исключение
        Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	ОтправкаПисемПоПочте.ОтправитьПисьма();
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
