Функция ПроверитьЛицензию(ИдентификаторКлиента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыКлиентов.ИдентификаторКлиента КАК ИдентификаторКлиента
		|ИЗ
		|	РегистрСведений.ИдентификаторыКлиентов КАК ИдентификаторыКлиентов
		|ГДЕ
		|	ИдентификаторыКлиентов.ИдентификаторКлиента = &ИдентификаторКлиента";
	
	Запрос.УстановитьПараметр("ИдентификаторКлиента", ИдентификаторКлиента);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе	
	    Возврат Истина;
	КонецЕсли;
КонецФункции // ПроверитьЛицензию()

Процедура ДобавитьЛицензию(ИдентификаторКлиента) Экспорт
	НаборЗаписей = РегистрыСведений.ИдентификаторыКлиентов.СоздатьНаборЗаписей();
	НоваяЛицензия = НаборЗаписей.Добавить();
    НоваяЛицензия.ИдентификаторКлиента = ИдентификаторКлиента;
	НаборЗаписей.Записать();
КонецПроцедуры

