Процедура ОтправитьПисьма() Экспорт 
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОтправкаПочты);
	Письма = Новый Массив;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОтправкиУведомлений.Документ КАК Документ,
		|	ОчередьОтправкиУведомлений.ДатаПриема КАК ДатаПриема,
		|	ОчередьОтправкиУведомлений.Статус КАК Статус,
		|	ОчередьОтправкиУведомлений.Отправлено КАК Отправлено,
		|	ОчередьОтправкиУведомлений.ОписаниеОшибки КАК ОписаниеОшибки,
		|	ОчередьОтправкиУведомлений.ДатаИзменилась КАК ДатаИзменилась,
		|	ОчередьОтправкиУведомлений.СтатусИзменился КАК СтатусИзменился,
		|	ОчередьОтправкиУведомлений.Документ.Клиент.АдресЭП КАК АдресЭП,
		|	ОчередьОтправкиУведомлений.Документ.Клиент КАК Клиент
		|ИЗ
		|	РегистрСведений.ОчередьОтправкиУведомлений КАК ОчередьОтправкиУведомлений
		|ГДЕ
		|	ОчередьОтправкиУведомлений.Отправлено = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Письмо=Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема="Запись на прием к врачу.";
		Письмо.ИмяОтправителя="MedStyle";
		Письмо.Отправитель="timofei.melnickov2015@yandex.ru";
		Письмо.Получатели.Добавить(Выборка.АдресЭП);
		
		ТекстПисьма = СтрШаблон("Уважаемый %1, ", Выборка.Клиент);
		Если Выборка.ДатаИзменилась Тогда
			ТекстПисьма = ТекстПисьма + "время вашего приема изменилось!"
		ИначеЕсли Выборка.СтатусИзменился Тогда
			ТекстПисьма = ТекстПисьма + "статус вашей записи изменился!"
		Иначе
			ТекстПисьма = ТекстПисьма + "отправляем Вам талон на прием!"
		КонецЕсли;
		Письмо.Тексты.Добавить(ТекстПисьма);
		ТабДок = Новый ТабличныйДокумент;
		Документы.Запись.Печать(ТабДок, Выборка.Документ);
		ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
		Письмо.Вложения.Добавить(ИмяФайла, "Талон");
		Письма.Добавить(Письмо);
		
		МенеджерЗаписи = РегистрыСведений.ОчередьОтправкиУведомлений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Документ = Выборка.Документ;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Отправлено = Истина;
		МенеджерЗаписи.ДатаИзменилась = Ложь;
		МенеджерЗаписи.СтатусИзменился = Ложь;
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	ТекстОшибки = "";
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	РаботаСПочтовымиСообщениями.ОтправитьПисьма(УчетнаяЗапись, Письма, ТекстОшибки);
КонецПроцедуры
