
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Если Объект.Услуга.Пустая() Тогда
		Объект.Длительность = 0;
		Объект.Сумма = 0;
	Иначе	
		ИнформацияОбУслуге = ПолучитьИнформациюОбУслуге(Объект.Услуга, Объект.Дата);
		Объект.Длительность = ИнформацияОбУслуге.Длительность;
		Объект.Сумма = ИнформацияОбУслуге.Цена;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОбУслуге(Услуга, Дата)
	Результат = Новый Структура("Длительность, Цена", 0, 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
		|	Услуги.Длительность КАК Длительность
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныСрезПоследних
		|		ПО Услуги.Ссылка = ЦеныСрезПоследних.Услуга
		|ГДЕ
		|	Услуги.Ссылка = &Услуга";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
	    Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;                                      
	Возврат Результат;
КонецФункции // ()

&НаКлиенте
Процедура ВремяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Изменение_Запись");
КонецПроцедуры


&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если Элемент.ВыделенныйТекст = "Завершено" Тогда
		Элементы.ФормаОказаниеУслуг.Видимость = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОказаниеУслуг(Команда)
	Данные = ОказаниеУслугНовый();
	ОткрытьФорму("Документ.ОказаниеУслуг.Форма.ФормаДокумента", Данные);
КонецПроцедуры 

&НаСервере
Функция ОказаниеУслугНовый()
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Клиент", Объект.Клиент);  
	ДанныеДокумента.Вставить("Организация", Объект.МедицинскийЦентр);
	
	Возврат ДанныеДокумента;
КонецФункции

&НаКлиенте
Процедура СправкаДляСпорта(Команда)
	ТабДок = Новый ТабличныйДокумент;
	//Документы.Запись.ПечатьСправкиДляСпорта(ТабДок, Объект.Ссылка);
	СправкаДляСпортаНаСервере(ТабДок, Объект.Ссылка);
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры 

&НаСервере
Процедура СправкаДляСпортаНаСервере(ТабДок, Док)
	Документы.Запись.ПечатьСправкиДляСпорта(ТабДок, Док);
КонецПроцедуры

&НаКлиенте
Процедура СправкаДляРаботы(Команда)
	ТабДок = Новый ТабличныйДокумент;
	//Документы.Запись.ПечатьСправкиДляРаботы(ТабДок, Объект.Ссылка);
	СправкаДляРаботыНаСервере(ТабДок, Объект.Ссылка);
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура СправкаДляРаботыНаСервере(ТабДок, Док)
	Документы.Запись.ПечатьСправкиДляРаботы(ТабДок, Док);
КонецПроцедуры

&НаКлиенте
Процедура СправкаНаправлениеНаКонсультацию(Команда)
	ТабДок = Новый ТабличныйДокумент;
	//Документы.Запись.ПечатьНаправления(ТабДок, Объект.Ссылка);
	СправкаНаправлениеНаКонсультациюНаСервере(ТабДок, Объект.Ссылка);
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура СправкаНаправлениеНаКонсультациюНаСервере(ТабДок, Док)
	Документы.Запись.ПечатьНаправления(ТабДок, Док);
КонецПроцедуры


