
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	МодульСуммы.РасчетСуммыТекущейСтроки(Элементы.Услуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	МодульСуммы.РасчетСуммыТекущейСтроки(Элементы.Услуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	МодульСуммы.РасчетСуммыДокумента(Объект.СуммаПоДокументу, Объект.Услуги);
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОбУслуге(Услуга, Дата)
	Результат = Новый Структура("Длительность, Цена", 0, 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
		|	Услуги.Длительность КАК Длительность
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныСрезПоследних
		|		ПО Услуги.Ссылка = ЦеныСрезПоследних.Услуга
		|ГДЕ
		|	Услуги.Ссылка = &Услуга";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
	    Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;                                      
	Возврат Результат;
КонецФункции // ()

&НаКлиенте
Процедура УслугиНаименованиеПриИзменении(Элемент)
	ИнформацияОбУслуге = ПолучитьИнформациюОбУслуге(Элементы.Услуги.ТекущиеДанные.Наименование, Объект.Дата);
	Элементы.Услуги.ТекущиеДанные.Цена = ИнформацияОбУслуге.Цена;
КонецПроцедуры
