
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Запись") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Организация = ДанныеЗаполнения.МедицинскийЦентр;
	КонецЕсли;
	Стр = Услуги.Добавить();
	Стр.Наименование = ДанныеЗаполнения.Услуга;
	ИнформацияОбУслуге = ПолучитьИнформациюОбУслуге(ДанныеЗаполнения.Услуга, ДанныеЗаполнения.Дата);

	Стр.Количество = 1;
	Стр.Цена = ИнформацияОбУслуге.Цена;
	Стр.Сумма = Стр.Цена;
КонецПроцедуры

Функция ПолучитьИнформациюОбУслуге(Услуга, Дата)
	Результат = Новый Структура("Длительность, Цена", 0, 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
		|	Услуги.Длительность КАК Длительность
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныСрезПоследних
		|		ПО Услуги.Ссылка = ЦеныСрезПоследних.Услуга
		|ГДЕ
		|	Услуги.Ссылка = &Услуга";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
	    Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;                                      
	Возврат Результат;
КонецФункции // ()

